In [1]:
import numpy as np
import pandas as pd

In [10]:
city_data={
    "city":["hyd","amr","che","blr","mum"],
    "state":["telangana","andhra pradesh","tamilnadu","karnataka","maharashtra"],
    "population":[15000000,10000000,12000000,14000000,17000000]
}

In [11]:
cities = pd.DataFrame(city_data)
cities

  city           state  population
0  hyd       telangana    15000000
1  amr  andhra pradesh    10000000
2  che       tamilnadu    12000000
3  blr       karnataka    14000000
4  mum     maharashtra    17000000

In [12]:
cities.transpose()

                    0               1          2          3            4
city              hyd             amr        che        blr          mum
state       telangana  andhra pradesh  tamilnadu  karnataka  maharashtra
population   15000000        10000000   12000000   14000000     17000000

In [13]:
cities.T

                    0               1          2          3            4
city              hyd             amr        che        blr          mum
state       telangana  andhra pradesh  tamilnadu  karnataka  maharashtra
population   15000000        10000000   12000000   14000000     17000000

In [14]:
random_data=np.random.randint(1,101,(3,5))
random_data

array([[68, 93, 46, 31, 83],
       [ 4, 30, 17,  9, 79],
       [90, 18, 84, 17, 84]], dtype=int32)

In [15]:
row_labels=["Morning","Afternoon","Evening"]
column_labels=["Monday","tuesday","wednesday","Thursday","Friday"]

In [16]:
pd.DataFrame(data=random_data,
             index=row_labels)

            0   1   2   3   4
Morning    68  93  46  31  83
Afternoon   4  30  17   9  79
Evening    90  18  84  17  84

In [19]:
random_df=pd.DataFrame(data=random_data,index=row_labels,columns=column_labels)
random_df

           Monday  tuesday  wednesday  Thursday  Friday
Morning        68       93         46        31      83
Afternoon       4       30         17         9      79
Evening        90       18         84        17      84

In [23]:
nba=pd.read_csv("nba.csv",parse_dates=["Birthday"])
nba

C:\Users\aayes\AppData\Local\Temp\ipykernel_26120\3349098481.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  nba=pd.read_csv("nba.csv",parse_dates=["Birthday"])

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [24]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [25]:
nba.nlargest(n=4,columns="Salary")

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000

In [ ]:
nba.nsmallest(n=3,columns='Birthday') #top 3 oldest

              Name             Team Position   Birthday   Salary
98    Vince Carter    Atlanta Hawks       PF 1977-01-26  2564753
196  Udonis Haslem       Miami Heat        C 1980-06-09  2564753
262    Kyle Korver  Milwaukee Bucks       PF 1981-03-17  6004753

In [29]:
nba["Name"].sum()

"Shake MiltonChristian WoodPJ WashingtonDerrick RoseMarial ShayokDraymond GreenKendrick NunnCedi OsmanBrook LopezTorrey CraigJordan ClarksonAlex CarusoNorvel PelleTyler JohnsonAlec BurksJaMychal GreenDwight HowardNikola JokicChris BoucherMarcus MorrisKevin HuerterRui HachimuraGeorge HillNickeil Alexander-WalkerJaylen HoardTyler CookOtto PorterLangston GallowayEvan TurnerNorman PowellNicolas ClaxtonMichael FrazierPaul MillsapFurkan KorkmazTrey BurkeBradley BealThomas BryantDean WadeChris PaulJosh HartLaMarcus AldridgeDaQuan JeffriesHamidou DialloJamal MurrayDarius BazleyRobert FranksGerald GreenThaddeus YoungSviatoslav MykhailiukIan MahinmiDeonte BurtonMarkelle FultzAaron GordonDzanan MusaPatrick McCawBismack BiyomboJaVale McGeeJuwan MorganMarc GasolMarcus SmartRudy GobertWesley IwunduDwight PowellGoran DragicTheo PinsonDanilo GallinariJoe InglesJarrett CulverRobert CovingtonDamyean DotsonPatrick BeverleyKevin LoveQuinn CookJustin Wright-ForemanNoah VonlehTyus JonesDewayne DedmonMalcolm BrogdonBen McLemoreWilson ChandlerIsaac BongaAdam MokokaLonzo BallJalen BrunsonJohn CollinsMarvin WilliamsBrad WanamakerDonte DiVincenzoOmari SpellmanJoe HarrisRoyce O'NealeDeandre AytonCory JosephMalcolm MillerJustise WinslowKevin DurantEvan FournierChris SilvaVince CarterCody ZellerBrian BowenAaron HolidayTroy DanielsBuddy HieldTerance MannJohn KoncharKZ OkpalaDenzel ValentineMarquese ChrissAnthony DavisNemanja BjelicaChandler ParsonsCourtney LeeMyles TurnerKyle O'QuinnBryn ForbesDuncan RobinsonDevin BookerGrant WilliamsDeMarcus CousinsDeMar DeRozanKristaps PorzingisBrandon KnightThabo SefoloshaDavid NwabaQuinndary WeatherspoonDewan HernandezIsaiah ThomasBruce BrownKeldon JohnsonDamian JonesLuguentz DortTerence DavisChandler HutchisonSteven AdamsJordan PooleSekou DoumbouyaZion WilliamsonMike MuscalaSkal LabissiereMeyers LeonardReggie JacksonAlfonzo McKinnieYuta WatanabeKentavious Caldwell-PopeKelan MartinOG AnunobyTyler HerroRichaun HolmesTyson ChandlerSolomon HillKeita Bates-DiopKelly OlynykJaxson HayesCJ McCollumDarius MillerLuka DoncicDeMarre CarrollCristiano FelicioZach LaVineTremont WatersDejounte MurrayJerome RobinsonRudy GayRyan BroekhoffJake LaymanCameron JohnsonAllen CrabbeJustin JamesEmmanuel MudiayAvery BradleyVictor OladipoCaleb MartinCoby WhiteIsaiah HartensteinWill BartonDwayne BaconHarrison BarnesTim FrazierJimmy ButlerGary HarrisThon MakerShai Gilgeous-AlexanderHassan WhitesideKarl-Anthony TownsKy BowmanBen SimmonsTerrence RossJordan McLaughlinDaniel TheisJonathan IsaacCheick DialloSerge IbakaAmile JeffersonCam ReddishDe'Anthony MeltonUdonis HaslemCharlie BrownElie OkoboGordon HaywardMarco BelinelliJavonte GreenRondae Hollis-JeffersonCarmelo AnthonyDanny GreenStephen CurryEric PaschallDaniel GaffordAnfernee SimonsFrank KaminskyLuke KennardJosh OkogieRodney HoodDe'Andre HunterKlay ThompsonJrue HolidayPJ DozierAndre DrummondJared HarperRussell WestbrookTony BradleyOshae BrissettGary ClarkPascal SiakamEric BledsoeTomas SatoranskyDavis BertansAmir CoffeyIgnas BrazdeikisIvan RabbKhris MiddletonKevin KnoxJeff GreenErsan IlyasovaCaleb SwaniganAl HorfordClint CapelaGeorges NiangWesley MatthewsRajon RondoDelon WrightJa MorantFred VanVleetBrandon ClarkeMiye OniJulius RandleGlenn Robinson IIIDillon BrooksZylan CheathamMarkieff MorrisMalik BeasleyJohn WallVlatko CancarAlize JohnsonAndrew WigginsKhyri ThomasMitchell RobinsonDamian LillardNassir LittleMikal BridgesKyle AndersonGarrett TempleKyle KorverAl-Farouq AminuJames HardenDerrick WhiteJaKarr SampsonDario SaricIvica ZubacJuan HernangomezJarrell BrantleyEric GordonNaz ReidJustin RobinsonGrayson AllenTrevor ArizaBrandon GoodwinE'Twaun MooreMario HezonjaHenry EllensonJohnathan MotleyJames EnnisAndre RobersonGarrison MathewsJahlil OkaforMfiondu KabengeleTreveon GrahamSeth CurryD'Angelo RussellJustin HolidayTyrone WallaceMiles BridgesBogdan BogdanovicMatt ThomasJordan BellWenyen GabrielTony SnellShaquille HarrisonYogi FerrellMike ScottJarred VanderbiltJeff TeagueZach NorvellMaxi KleberMatisse ThybulleRyan ArcidiaconoWayne EllingtonKawhi LeonardMontrezl HarrellJusuf NurkicMatthew DellavedovaCody MartinZhaire SmithRJ BarrettLonnie WalkerTaurean PrinceElfrid PaytonBlake GriffinMarko GuduricZach CollinsStanley JohnsonBoban MarjanovicJosh MagetteKyle LowryDarius GarlandFrank JacksonDragan BenderKenrich WilliamsJerami GrantAllonzo TrierPat ConnaughtonDomantas SabonisDylan WindlerAntonius ClevelandDamion LeeKhem BirchAron BaynesKemba WalkerNerlens NoelJabari ParkerCarsen EdwardsAnthony TolliverLauri MarkkanenKris DunnReggie BullockMike ConleyJaylen NowellGorgui DiengPatrick PattersonJarrett AllenBobby PortisJoel EmbiidJonas ValanciunasChris ChiozzaKent BazemoreTristan ThompsonMason PlumleeShabazz NapierEdmond SumnerAlex LenJosh RichardsonBojan BogdanovicIman ShumpertDaryl MaconRodney McGruderBam AdebayoJacob EvansNigel Williams-GossTerrance FergusonMichael Carter-WilliamsBol BolWillie Cauley-SteinNikola VucevicNicolas BatumKyrie IrvingJeremy LambDonovan MitchellThanasis AntetokounmpoJames JohnsonMonte MorrisTerry RozierDeAndre JordanJae CrowderJosh GrayGoga BitadzeKobi SimmonsDerrick FavorsLandry ShametJalen McDanielsBruno CabocloDrew EubanksRaul NetoJalen LecqueGiannis AntetokounmpoMalik MonkTacko FallJustin JacksonPaul GeorgeJayson TatumAdmiral SchofieldLouis KingKostas AntetokounmpoRodions KurucsSpencer DinwiddieDoug McDermottRomeo LangfordCaris LeVertMichael Kidd-GilchristLeBron JamesTaj GibsonTy JeromeChris ClemonsLuke KornetTrey LylesSterling BrownAndre IguodalaVincent PoirierFrank NtilikinaJordan McRaeEnes KanterJohn HensonJaylen BrownJonah BoldenChimezie MetuTobias HarrisSemi OjeleyeJevon CarterBrandon IngramMoritz WagnerDorian Finney-SmithDanuel HouseNicolo MelliTalen Horton-TuckerEd DavisKyle GuyKadeem AllenDante ExumAbdel NaderBruno FernandoDion WaitersJared DudleyMax StrusKevon LooneyWilly HernangomezMelvin FrazierAustin RiversHarry GilesRobin LopezCollin SextonRicky Rubio"

In [30]:
nba["Position"].sum()

'SGPFPFPGGPFSGSFCSFPGPGFCPGSGPFCCPFPFSGPFPGSGSFPFSFPGPGSGPFGPFSGPGSGCPFPGSFCSGSFPGPFFSFPFSFCSGPGPFSFSFCCFCPGCSFCPGSGPFPFSGPFSGPGCPGGCPGCPGSGPFPGGPGPGPFPFPGSGPFSFPFCPGSFPFPFSFPFPFCSGPGSGSGSGSGSFSFPFCPFSFSGCCSGPFSGPFCSFPFPGPFSFGCPGSGSFCGSGSFCSGSFFCCCPGSFSFSGSFSFSGCCSFSFCCSGSFPGPFCPGPGPGSGPFSGPFPFSGSGPGPGPGSFSGCSFSGPFPGSFSGCPGCCPGPGSFPGCPFCCPFSFPGCSGPGPFSFSFSFPFSGPGPFCSGCSGSGSFSFSGPGPGCPGPGCSFPFPFPGPGPFGSFPFSFPFPFPFPFCCPFSFPGPGPGPGPFSGCSFSFSFPFSGPGSFPFSFSGCPGPFSFPFPGPFPFPGPGSFPFCPFPFPGFPGSGSFPGPGPFPFPFSFSFSGCCSGPGPGSGPGSFSGSGCPFSFPGPGPFPFPGSGCSGPGSGSFCCPGSFSGSGSGSFPGPFSGCPFCPGPGPGPGPFPFPFPGSGCGFSGSGCCPGCPFSGPFPFPGSFPGSGCPFCCCCPGSFCCPGPGCSFSFPGSGSGCSGPGSFPGCCCSFPGSFSGSFPFPGPGCSFPGCPGCSGPFSFPFPGGPFSGCPFSFPFSFFPFPFPGPFSGSFPFPFCGSGCPFSFSFCPGPGCCSFPFPFPFPFPGPFCPFSFCGFCGPGPGSFCSGPFSGCCSGPGPFCPGPG'

In [31]:
nba.dtypes

Name                object
Team                object
Position            object
Birthday    datetime64[ns]
Salary               int64
dtype: object

In [32]:
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [33]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [34]:
nba.median(numeric_only=True)

Salary    3303074.5
dtype: float64

In [35]:
nba.mode(numeric_only=True)

   Salary
0   79568

In [36]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

In [38]:
nba=nba.sort_values(by=["Team","Salary"],ascending=[True,False])
nba

                  Name                Team Position   Birthday    Salary
111   Chandler Parsons       Atlanta Hawks       SF 1988-10-25  25102512
28         Evan Turner       Atlanta Hawks       PG 1988-10-27  18606556
167       Allen Crabbe       Atlanta Hawks       SG 1992-04-09  18500000
213    De'Andre Hunter       Atlanta Hawks       SF 1997-12-02   7068360
339      Jabari Parker       Atlanta Hawks       PF 1995-03-15   6500000
..                 ...                 ...      ...        ...       ...
80         Isaac Bonga  Washington Wizards       PG 1999-11-08   1416852
399  Admiral Schofield  Washington Wizards       SF 1997-03-30   1000000
273    Justin Robinson  Washington Wizards       PG 1997-10-12    898310
283   Garrison Mathews  Washington Wizards       SG 1996-10-24     79568
353      Chris Chiozza  Washington Wizards       PG 1995-11-21     79568

[450 rows x 5 columns]

In [61]:
nba.set_index(keys="Name")

KeyError: "None of ['Name'] are in the columns"

In [60]:
nba.sort_index(axis="columns",ascending=False)

                                 Team    Salary Position   Birthday
Name
Chandler Parsons        Atlanta Hawks  25102512       SF 1988-10-25
Evan Turner             Atlanta Hawks  18606556       PG 1988-10-27
Allen Crabbe            Atlanta Hawks  18500000       SG 1992-04-09
De'Andre Hunter         Atlanta Hawks   7068360       SF 1997-12-02
Jabari Parker           Atlanta Hawks   6500000       PF 1995-03-15
...                               ...       ...      ...        ...
Isaac Bonga        Washington Wizards   1416852       PG 1999-11-08
Admiral Schofield  Washington Wizards   1000000       SF 1997-03-30
Justin Robinson    Washington Wizards    898310       PG 1997-10-12
Garrison Mathews   Washington Wizards     79568       SG 1996-10-24
Chris Chiozza      Washington Wizards     79568       PG 1995-11-21

[450 rows x 4 columns]

In [59]:
nba.sort_index(axis=0)

                                    Team Position   Birthday    Salary
Name
Aaron Gordon               Orlando Magic       PF 1995-09-16  19863636
Aaron Holiday             Indiana Pacers       PG 1996-09-30   2239200
Abdel Nader        Oklahoma City Thunder       SF 1993-09-25   1618520
Adam Mokoka                Chicago Bulls        G 1998-07-18     79568
Admiral Schofield     Washington Wizards       SF 1997-03-30   1000000
...                                  ...      ...        ...       ...
Zach LaVine                Chicago Bulls       PG 1995-03-10  19500000
Zach Norvell          Los Angeles Lakers       SG 1997-12-09     79568
Zhaire Smith          Philadelphia 76ers       SG 1999-06-04   3058800
Zion Williamson     New Orleans Pelicans        F 2000-07-06   9757440
Zylan Cheatham      New Orleans Pelicans       SF 1995-11-17     79568

[450 rows x 4 columns]